HL7v2-ORUR01-2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Body xmlns:m="http://192.168.163.129/medical_warehouse/warehouse.php">
  <m:ingest_file>
    <m:clientId>Sam_Test</m:clientId>
    <m:md5>81dc9bdb52d04dc20036dbd8313ed055</m:md5>
    <m:format>HL7v2</m:format>
    <m:payload><![CDATA[MSH|^~\&|GHH LAB|ELAB-3|GHH OE|BLDG4|200202150930||ORU^R01|CNTRL-3456|P|2.4
 PID|||555-44-4444||EVERYWOMAN^EVE^E^^^^L|JONES|19620320|F|||153 FERNWOOD DR.^^STATESVILLE^OH^35292||(206)3345232|(206)752-121||||AC555444444||67-A4335^OH^20030520
 OBR|1|845439^GHH OE|1045813^GHH LAB|15545^GLUCOSE|||200202150730|||||||||555-55-5555^PRIMARY^PATRICIA P^^^^MD^^|||||||||F||||||444-44-4444^HIPPOCRATES^HOWARD H^^^^MD
 OBX|1|SN|1554-5^GLUCOSE^POST 12H CFST:MCNC:PT:SER/PLAS:QN||^182|mg/dl|70_105|H|||F]]></m:payload>
  </m:ingest_file>
</soap:Body>
</soap:Envelope>